{
  "recruiter": [
    {
      "id": 1,
      "fullname": "Горкина В.М.",
      "lastName": "Горкина",
      "firstName": "Виктория"
    },
    {
      "id": 2,
      "fullname": "Демина Ю.М.",
      "lastName": "Демина",
      "firstName": "Юлия"
    },
    {
      "id": 3,
      "fullname": "Крупко А.С.",
      "lastName": "Крупко",
      "firstName": "Александра"
    }
  ],
  "vacancy": [
    {
      "customerId": 2,
      "id": 1,
      "title": "Разработчик программного обеспечения",
      "salaryFrom": "160 000 руб",
      "salaryTo": "210 000 руб",
      "duties": "Разработка и поддержка программного обеспечения для клиентов компании, Участие в проектировании и архитектуре программных продуктов Тестирование и отладка программного кода, Интеграция и оптимизация существующих систем, Участие в коллективной разработке и обсуждении новых идей",
      "requirement": "Опыт работы от 2 лет в разработке программного обеспечения, Знание языков программирования, таких как Java, C++, Python, Опыт работы с базами данных (SQL, NoSQL), Умение работать в команде и общаться с коллегами, Аналитическое мышление и способность решать сложные задачи, Желание развиваться и изучать новые технологии",
      "conditions": "Конкурентная заработная плата, соответствующая опыту и квалификации, Гибкий график работы и возможность удаленной работы, Профессиональный рост и обучение в рамках компании, Дружный коллектив и командные мероприятия, Комфортные условия работы в современном офисе"
    },
    {
      "customerId": 1,
      "id": 2,
      "title": "Веб-дизайнер",
      "salaryFrom": "110 000 руб",
      "salaryTo": "200 000 руб",
      "duties": "Разработка и создание уникального веб-дизайна для клиентов компании, Работа над концепцией и визуальным оформлением веб-проектов, Создание макетов, иллюстраций и графических элементов для веб-сайтов, Оптимизация и адаптация дизайна под различные устройства и браузеры, Сотрудничество с командой разработчиков для реализации дизайн-концепции",
      "requirement": "Опыт работы от 2 лет в веб-дизайне, Глубокое понимание принципов дизайна и композиции, Знание графических программ, таких как Adobe Photoshop, Adobe Illustrator, Sketch, Умение создавать привлекательные и интуитивно понятные пользовательские интерфейсы, Понимание основных принципов HTML и CSS, Креативность, чувство стиля и внимание к деталям",
      "conditions": "Конкурентная заработная плата, соответствующая опыту и квалификации, Гибкий график работы и возможность удаленной работы, Профессиональный рост и обучение в рамках компании, Дружный коллектив и командные мероприятия, Комфортные условия работы в современном офисе"
    },
    {
      "customerId": 1,
      "id": 3,
      "title": "DevOps инженер",
      "salaryFrom": "120 000 руб",
      "salaryTo": "190 000 руб",
      "duties": "Разработка и поддержка инфраструктуры для развертывания и управления приложениями, Автоматизация процессов разработки, тестирования и развертывания приложений, Управление системами контроля версий и конфигурацией, Мониторинг и обеспечение высокой доступности системы, Оптимизация производительности и масштабируемости приложений, Взаимодействие с командой разработчиков для обеспечения непрерывной интеграции и доставки",
      "requirement": "Опыт работы от 3 лет в области DevOps, Глубокое понимание принципов разработки программного обеспечения и системной архитектуры, Знание инструментов автоматизации и оркестрации, таких как Docker, Kubernetes, Jenkins, Ansible, Опыт работы с облачными платформами, такими как AWS, Azure, Google Cloud, Навыки программирования на языках Python, Bash, Ruby или других языках сценариев, Понимание основных принципов сетевых технологий и протоколов, Умение работать в команде и эффективно коммуницировать",
      "conditions": "Конкурентная заработная плата, соответствующая опыту и квалификации, Гибкий график работы и возможность удаленной работы, Профессиональный рост и обучение в рамках компании, Дружный коллектив и командные мероприятия, Комфортные условия работы в современном офисе"
    }
  ],
  "candidate": [
    {
      "id": 1,
      "address": "Москва",
      "fullName": "Соколов Василь",
      "email": "sokolovivan@gmail.com",
      "phoneNumber": "+7 123 456 7890",
      "telegram": "sokolovivan",
      "urls": "https://career.habr.com/viktoriia_gorkina",
      "profile": "Опытный Backend разработчик с более чем 5-летним опытом работы в создании и поддержке веб-приложений. Умение разрабатывать серверную часть приложений с использованием различных языков программирования и фреймворков. Опыт работы с базами данных и API.",
      "experience": "Backend разработчик, ООО WebDev, г. Москва, Разработка серверной части веб-приложений с использованием языков программирования Python и Java. Создание и оптимизация баз данных для хранения информации. Работа в команде разработчиков и тестировщиков для достижения требуемых результатов. Интеграция с внешними API для получения и отправки данных.",
      "education": "Бакалавр информатики, Московский Государственный Университет, г. Москва",
      "skills": "Опыт работы с языками программирования Python, Java. Знание фреймворков и библиотек, таких как Django, Spring. Понимание принципов работы с базами данных, таких как MySQL, PostgreSQL. Умение работать с системами контроля версий, такими как Git. Знание основ безопасности и защиты данных. Навыки работы с командной строкой и Linux.",
      "languages": "Русский (родной), Английский (свободное владение)",
      "projects": "1. Разработка RESTful API для онлайн-магазина, Создание серверной части приложения с использованием Django и Python. Реализация CRUD операций для управления товарами, заказами и пользователями. Интеграция с платежными системами для обработки платежей. 2. Создание системы управления контентом для блога, Разработка административной панели с использованием Java и Spring. Реализация возможности создания, редактирования и удаления статей блога. Интеграция с базой данных для хранения информации.",
      "sertificates": "Сертификат по Backend разработке, Udemy, Сертификат по Python, Codecademy",
      "hobby": "В свободное время увлекаюсь чтением книг по программированию, изучением новых технологий и участием в программистских соревнованиях. Люблю играть в футбол и путешествовать.",
      "comment": "лайфкоддинг"
    },
    {
      "id": 2,
      "address": "Санкт-Петербург",
      "fullName": "Новико",
      "email": "novikovalex@gmail.com",
      "phoneNumber": "+7 123 456 7890",
      "telegram": "novikovalex",
      "urls": "https://career.habr.com/viktoriia_gorkina",
      "profile": "Опытный DevOps инженер с более чем 5-летним опытом работы в области разработки и поддержки инфраструктуры. Умение автоматизировать процессы развертывания и управления приложениями с использованием современных инструментов и технологий. Опыт работы с облачными платформами и контейнеризацией.",
      "experience": "DevOps инженер, ООО TechOps, г. Москва, Разработка и поддержка инфраструктуры для развертывания приложений. Автоматизация процессов развертывания и управления при помощи инструментов, таких как Ansible, Terraform. Настройка и поддержка систем мониторинга и логирования. Работа в команде разработчиков и тестировщиков для обеспечения непрерывной поставки.",
      "education": "Бакалавр информатики, Московский Государственный Университет, г. Москва",
      "skills": "Опыт работы с инструментами автоматизации развертывания, такими как Ansible, Terraform. Знание контейнерных платформ, таких как Docker, Kubernetes. Опыт работы с облачными платформами, такими как AWS, Azure. Навыки программирования на языках Python, Bash. Понимание принципов CI/CD и опыт работы с инструментами, такими как Jenkins, GitLab CI/CD. Знание систем мониторинга и логирования, таких как Prometheus, ELK Stack.",
      "languages": "Русский (родной), Английский (свободное владение)",
      "projects": "1. Развертывание микросервисной архитектуры на платформе Kubernetes, Автоматизация развертывания и масштабирования при помощи инструментов Kubernetes. Настройка систем мониторинга и логирования для обеспечения высокой доступности и отслеживания проблем. Интеграция с CI/CD инструментами для непрерывной поставки.",
      "sertificates": "Сертификат по DevOps, Udemy, Сертификат по AWS, Amazon Web Services",
      "hobby": "В свободное время увлекаюсь программированием и изучением новых технологий. Люблю играть в видеоигры и заниматься спортом.",
      "comment": "первичное интервью"
    },
    {
      "id": 3,
      "address": "Воронеж",
      "fullName": "Федорова",
      "email": "fedorovalena@gmail.com",
      "phoneNumber": "+7 123 456 7890",
      "telegram": "fedorovalena",
      "urls": "https://career.habr.com/viktoriia_gorkina",
      "profile": "Опытный Frontend разработчик с более чем 3-летним опытом работы в создании и поддержке веб-приложений. Умение разрабатывать пользовательский интерфейс с использованием современных технологий и инструментов. Опыт работы с различными фреймворками и библиотеками.",
      "experience": "Frontend разработчик, ООО WebDev, г. Москва, Разработка и поддержка пользовательского интерфейса для веб-приложений. Создание адаптивного и кросс-браузерного дизайна с использованием HTML, CSS и JavaScript. Работа в команде разработчиков и дизайнеров для достижения требуемых результатов. Оптимизация производительности и улучшение пользовательского опыта.",
      "education": "Бакалавр информатики, Московский Государственный Университет, г. Москва",
      "skills": "Опыт работы с HTML, CSS, JavaScript. Знание фреймворков и библиотек, таких как React, Angular, Vue.js. Понимание принципов респонсивного дизайна и оптимизации производительности. Умение работать с системами контроля версий, такими как Git. Знание основ SEO и оптимизации для поисковых систем. Навыки работы с графическими редакторами, такими как Photoshop, Sketch.",
      "languages": "Русский (родной), Английский (свободное владение)",
      "projects": "1. Разработка интернет-магазина на фреймворке React, Создание пользовательского интерфейса для интернет-магазина с использованием React и Redux. Интеграция с API для получения данных о товарах и оформления заказов. Оптимизация производительности и улучшение пользовательского опыта. 2. Создание лендинга для мобильного приложения, Разработка адаптивного лендинга с использованием HTML, CSS и JavaScript. Интеграция с API для получения информации о приложении и возможности загрузки. Оптимизация для поисковых систем и улучшение конверсии.",
      "sertificates": "Сертификат по Frontend разработке, Udemy, Сертификат по HTML и CSS, Codecademy",
      "hobby": "В свободное время увлекаюсь чтением книг, изучением новых технологий и посещением технических конференций. Люблю заниматься спортом и путешествоват.",
      "comment": ""
    },
    {
      "id": 4,
      "address": "Коммуны",
      "fullName": "Виктория ",
      "email": "v9218743998@yandex.ru",
      "phoneNumber": "+79218743998",
      "telegram": "",
      "urls": "",
      "profile": "",
      "experience": "",
      "education": "",
      "skills": "",
      "languages": "",
      "projects": "",
      "sertificates": "",
      "hobby": "",
      "comment": ""
    },
    {
      "address": "Позвоните мне по телефону",
      "fullName": "Вика",
      "email": "v.gorkina.job@gmail.com",
      "phoneNumber": "+79218743998",
      "telegram": "",
      "urls": "",
      "profile": "",
      "experience": "",
      "education": "",
      "skills": "",
      "languages": "",
      "projects": "",
      "sertificates": "",
      "hobby": "",
      "comment": "",
      "id": 5
    },
    {
      "address": "Коммуны",
      "fullName": "Гребнева Анна",
      "email": "v9218743998@yandex.ru",
      "phoneNumber": "+79218743998",
      "telegram": "",
      "urls": "",
      "profile": "цукен",
      "experience": "цсжмщвмгпрол",
      "education": "цукенро",
      "skills": "цукенро",
      "languages": "ывапр",
      "projects": "",
      "sertificates": "",
      "hobby": "",
      "comment": "",
      "id": 6
    }
  ],
  "comments": [
    {
      "candidateId": 1,
      "id": 1,
      "comment": "лайфкоддинг",
      "author": "Горкина В.М."
    },
    {
      "candidateId": 2,
      "id": 2,
      "comment": "первичное интервью",
      "author": "Горкина В.М."
    },
    {
      "candidateId": 3,
      "id": 3,
      "comment": "",
      "author": "Горкина В.М."
    }
  ],
  "customer": [
    {
      "vacancyId": 1,
      "id": 1,
      "email": "test@gmail.com",
      "name": "Банк"
    },
    {
      "vacancyId": 2,
      "id": 2,
      "email": "test2@gmail.com",
      "name": "Университет"
    },
    {
      "vacancyId": 3,
      "id": 3,
      "email": "test3@gmail.com",
      "name": "Компания"
    }
  ],
  "templates": [
    {
      "vacancyId": 3,
      "id": 1,
      "name": "Frontend dev_Банк",
      "author": "Горкина В.М.",
      "body": "Уважаемый(ая) [Имя кандидата], Я обратил внимание на ваш профессиональный профиль и хотел бы пригласить вас к рассмотрению вакансии фронтенд разработчика в нашей компании. Учитывая ваш опыт работы в создании и поддержке веб-приложений, а также умение разрабатывать серверную часть приложений с использованием различных языков программирования и фреймворков, я уверен(а), что вы можете стать ценным членом нашей команды. Ваш опыт работы в ООО WebDev, где вы разрабатывали серверную часть веб-приложений с использованием Python и Java, а также работали с базами данных и внешними API, очень ценен для нас. Ваше образование в Московском Государственном Университете, где вы получили степень бакалавра информатики, также добавляет вам преимущество перед другими кандидатами. Ваши навыки работы с языками программирования Python и Java, фреймворками Django и Spring, а также базами данных MySQL и PostgreSQL, являются необходимыми для успешной работы фронтенд разработчиком. Ваше знание систем контроля версий, таких как Git, и основ безопасности и защиты данных также очень ценно. Я обратил внимание на ваши проекты, в которых вы разрабатывали RESTful API для онлайн-магазина с использованием Django и Python, а также систему управления контентом для блога с использованием Java и Spring. Ваши навыки интеграции с платежными системами и работой с базами данных являются важными для нашей компании. Кроме того, я заметил(а) ваши сертификаты по Backend разработке и Python, которые подтверждают вашу компетентность в этих областях. Вне работы, я рад(а) видеть ваше увлечение чтением книг по программированию, изучением новых технологий и участием в программистских соревнованиях. Ваша любовь к футболу и путешествиям также отражает вашу активную жизненную позицию. Если вы заинтересованы в рассмотрении предложения о работе фронтенд разработчиком в нашей компании, пожалуйста, дайте мне знать. Я готов(а) ответить на все ваши вопросы и обсудить возможности сотрудничества. С уважением, [Ваше имя]"
    }
  ]
}